// ============================================================================
//  МОДУЛЬ: ОБЫЧНЫЕ АРТЕФАКТЫ (COMMON)
// ============================================================================

export const ARTIFACTS_COMMON = {
    "crown_of_chaos": { 
        id: "crown_of_chaos", 
        name: "Корона Хаоса", 
        type: "голова", 
        emoji: "👑", 
        slotType: "голова", 
        rarity: "common", 
        description: "Древняя корона, усиливающая хаотическую энергию", 
        lore: "Корона была создана из останков Древнего Оверлорда и несет его разрушительную природу" 
    },
    "thorn_necklace": { 
        id: "thorn_necklace", 
        name: "Терновое ожерелье", 
        type: "шея", 
        emoji: "🎗️", 
        slotType: "шея", 
        rarity: "common", 
        description: "Ожерелье из терний, защищающее от проклятий", 
        lore: "Говорят, что это ожерелье носил самый чистый человек, и шипы этого ожерелья очищали его душу от греха" 
    },
    "blade_of_abyss": { 
        id: "blade_of_abyss", 
        name: "Клинок бездны", 
        type: "правая_рука", 
        emoji: "🗡️", 
        slotType: "правая_рука", 
        rarity: "common", 
        description: "Клинок, выкованный в самой бездне", 
        lore: "В Бездне бывало очень мало демонов, что уж говорить о смертных. Говорят, этот меч был выкован самим Азазелем, который чуть не растворился в Бездне ради создания столь сильного артефакта" 
    },
    "endless_gold": { 
        id: "endless_gold", 
        name: "Мешочек бесконечного золота", 
        type: "карман", 
        emoji: "💰", 
        slotType: "карман", 
        rarity: "common", 
        description: "Мешочек, который приносит 250 золотых монет ежедневно", 
        lore: "маленькая приятная вещица, которая может позволить герою немного больше трат" 
    },
    "mantle_of_dreams": { 
        id: "mantle_of_dreams", 
        name: "Мантия снов", 
        type: "плащ", 
        emoji: "🥻", 
        slotType: "плащ", 
        rarity: "common", 
        description: "Мантия, сотканная из сновидений",
        lore: ""
    },
    "stuff_of_shadows": { 
        id: "stuff_of_shadows", 
        name: "Посох теней", 
        type: "правая_рука", 
        emoji: "🪄", 
        slotType: "правая_рука", 
        rarity: "common", 
        description: "Жезл, преобразующий тени", 
        lore: "Посох собирает в себя тень любого живого существа, чтобы потом призвать искаженный злой образ" 
    },
    "astral_piercer": { 
        id: "astral_piercer", 
        name: "Астральный пронзатель", 
        type: "правая_рука", 
        emoji: "🔱", 
        slotType: "правая_рука", 
        rarity: "common", 
        description: "Копьё, пропитанное астральной энергией",
        lore: ""
    }
};
